import moment from "moment";

const str = '[00:05.946]你是我心中的日月光芒 [00:16.493]手中握着格桑花呀 [00:19.759]美得让我忘了摘下 [00:23.527]你的真 带着香 [00:25.780]你的香 会说话 [00:27.785]你的话好像只对我说 [00:32.313]我的专长叫做流浪 [00:35.579]你注定要为我绽放 [00:39.090]我的心 寻找家 [00:41.094]我的家 没有花 [00:43.357]我的花却在这山谷等着我 [00:47.371]若一开始 [00:48.372]没有上帝 [00:49.376]暗中偷偷地怂恿 [00:50.883]我们怎知选择相逢 [00:55.154]你是心中的日月 [00:58.665]落在这里 [01:02.690]旅程的前后多余 [01:06.448]只为遇到你 [01:10.472]多么想幻化成为你脚下的泥 [01:16.746]yeah 此刻的无人山谷 [01:23.269]仿佛听见说爱你 [01:32.748]你是我心中的日月光芒 [01:42.781]我的漂泊不懂泥巴 [01:46.301]你的美丽不堪动荡 [01:49.807]你单纯 我迷惘 [01:51.570]你恋家 我流浪 [01:53.573]山谷中这一切带不走 [01:57.842]你爱抬头拥抱阳光 [02:01.097]我得眺望下个前往 [02:04.362]我走开 你留下 [02:06.369]我回忆 你升华 [02:08.377]至少我们会仰望同一片天空 [02:12.904]若一开始 [02:13.907]没有上帝 [02:15.157]暗中偷偷地怂恿 [02:17.175]我们怎知选择相逢 喔 [02:20.935]你是心中的日月 [02:24.701]落在这里 [02:28.469]旅程的前后多余 [02:31.981]只为遇到你 [02:36.247]多么想幻化成为你脚下的泥 [02:44.026]yeah 那天的无人山谷 [02:49.550]仿佛听见说爱你 [02:55.566]置身在 传说中 [02:57.071]人间天堂 [02:59.082]你是我心中的日月光芒 [03:02.849]带领我找到你的芬芳 [03:08.053]放不下 [03:10.069]你是心中的日月 [03:13.327]落在这里 [03:17.094]旅程的前后多余 [03:20.600]只为遇到你 [03:24.626]多么想幻化成为你脚下的泥 [03:34.414]那天的无人山谷 [03:38.179]仿佛听见说爱你 [03:45.963]那天听见说爱你'
const reg = /[^\[](?<min>.*?):(?<second>.*?)](?<text>.*?)(\s\[|$)/g
const result = str.matchAll(reg)
let lyricsArray = []
for(let item of result)
{
    let curTime = Math.floor((Number(item.groups.min) * 60 + Number(item.groups.second)) * 1000)
    lyricsArray.push({time: curTime, lyric: item.groups.text})
}
console.log(lyricsArray)
